In [117]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [118]:
"""Creating a Series by passing a list of values, letting pandas create a default integer index"""
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [119]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [120]:
"""Creating a DataFrame"""
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [121]:
df = pd.DataFrame(np.random.randn(6,5), index=dates, columns=list('ABCDE'))

In [122]:
df

                   A         B         C         D         E
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141

In [123]:
"""Creating a DataFrame by passing a dict of objects that can be converted to series-like"""
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)),dtype='float32'),
                    'D': np.array([3] * 2 + [2] *2, dtype = 'int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  2   test  foo
3  1.0 2013-01-02  1.0  2  train  foo

In [124]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [125]:
"""Viewing Data"""
df.head()

                   A         B         C         D         E
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193

In [126]:
df.tail(3)

                   A         B         C         D         E
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141

In [127]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [128]:
df.columns

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object')

In [129]:
"""Describe shows a quick statistic summary of your data"""
df.describe()

              A         B         C         D         E
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean  -0.448629 -0.163517 -0.041007 -0.227095  0.934542
std    0.759528  0.950512  1.216964  0.612683  0.852901
min   -1.322116 -1.780693 -1.353458 -1.245138 -0.372690
25%   -1.052191 -0.528048 -1.078623 -0.402753  0.582019
50%   -0.463054  0.040522  0.032282 -0.185140  0.927922
75%    0.205852  0.554240  0.530708  0.064269  1.386921
max    0.376197  0.710643  1.794927  0.580733  2.117459

In [130]:
"""Transposing your data"""
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.066390   -0.992497    0.252339   -1.322116   -1.072089    0.376197
B    0.423356    0.710643    0.597867   -0.342312   -0.589960   -1.780693
C   -0.335250    0.399813    0.574339   -1.353458   -1.326414    1.794927
D    0.126074   -1.245138   -0.453959   -0.121146   -0.249133    0.580733
E    1.478497    2.117459    0.743652   -0.372690    1.112193    0.528141

In [131]:
"""Sorting by an axis: 0-Row, 1-Column"""
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2013-01-01  1.478497  0.126074 -0.335250  0.423356  0.066390
2013-01-02  2.117459 -1.245138  0.399813  0.710643 -0.992497
2013-01-03  0.743652 -0.453959  0.574339  0.597867  0.252339
2013-01-04 -0.372690 -0.121146 -1.353458 -0.342312 -1.322116
2013-01-05  1.112193 -0.249133 -1.326414 -0.589960 -1.072089
2013-01-06  0.528141  0.580733  1.794927 -1.780693  0.376197

In [132]:
"""Sorting by values"""
df.sort(columns='B', ascending=False)

/Users/Jianyu/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  from ipykernel import kernelapp as app

                   A         B         C         D         E
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141

In [133]:
"""Selecting a single column, which yiels a Series"""
df['A']

2013-01-01    0.066390
2013-01-02   -0.992497
2013-01-03    0.252339
2013-01-04   -1.322116
2013-01-05   -1.072089
2013-01-06    0.376197
Freq: D, Name: A, dtype: float64

In [134]:
"""Selecting via[], which slices the rows"""
df[0:3]

                   A         B         C         D         E
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652

In [135]:
df['20130102':'20130104']

                   A         B         C         D         E
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690

In [136]:
"""Selection by multi-axis by label"""
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.066390  0.423356
2013-01-02 -0.992497  0.710643
2013-01-03  0.252339  0.597867
2013-01-04 -1.322116 -0.342312
2013-01-05 -1.072089 -0.589960
2013-01-06  0.376197 -1.780693

In [137]:
"""For getting a scalar value"""
df.loc[dates[0], 'A']

0.066389850628691904

In [138]:
"""Selection by Position"""
df.iloc[3]

A   -1.322116
B   -0.342312
C   -1.353458
D   -0.121146
E   -0.372690
Name: 2013-01-04 00:00:00, dtype: float64

In [139]:
"""By integers slices: Front-row, Back-column"""
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.322116 -0.342312
2013-01-05 -1.072089 -0.589960

In [140]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.992497  0.399813
2013-01-03  0.252339  0.574339
2013-01-05 -1.072089 -1.326414

In [141]:
"""Boolean Indexing
Using a single column's values to select data"""
df[df.A > 0]

                   A         B         C         D         E
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141

In [142]:
df[df > 0]

                   A         B         C         D         E
2013-01-01  0.066390  0.423356       NaN  0.126074  1.478497
2013-01-02       NaN  0.710643  0.399813       NaN  2.117459
2013-01-03  0.252339  0.597867  0.574339       NaN  0.743652
2013-01-04       NaN       NaN       NaN       NaN       NaN
2013-01-05       NaN       NaN       NaN       NaN  1.112193
2013-01-06  0.376197       NaN  1.794927  0.580733  0.528141

In [143]:
"""Using isin() method for filtering"""
df3 = df.copy()

In [144]:
df3['F']=['one', 'one', 'two', 'three', 'four', 'three']

In [145]:
df3

                   A         B         C         D         E      F
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497    one
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459    one
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652    two
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690  three
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193   four
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141  three

In [146]:
df3[df3['F'].isin(['two', 'four'])]

                   A         B         C         D         E     F
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652   two
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193  four

In [147]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102', periods =6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [148]:
df['F'] = s1

In [149]:
df

                   A         B         C         D         E    F
2013-01-01  0.066390  0.423356 -0.335250  0.126074  1.478497  NaN
2013-01-02 -0.992497  0.710643  0.399813 -1.245138  2.117459  1.0
2013-01-03  0.252339  0.597867  0.574339 -0.453959  0.743652  2.0
2013-01-04 -1.322116 -0.342312 -1.353458 -0.121146 -0.372690  3.0
2013-01-05 -1.072089 -0.589960 -1.326414 -0.249133  1.112193  4.0
2013-01-06  0.376197 -1.780693  1.794927  0.580733  0.528141  5.0

In [150]:
"""SETTING VALUES BY LABEL"""
df.at[dates[0], 'A'] = 0

In [151]:
"""SETTING VALUES BY POSITION"""
df.iat[0,1] = 0

In [152]:
"""SETTING BY ASSIGNING WITH A NUMPY ARRAY"""
df.loc[:, 'D'] = np.array([5] * len(df))

In [153]:
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -0.335250  5  1.478497  NaN
2013-01-02 -0.992497  0.710643  0.399813  5  2.117459  1.0
2013-01-03  0.252339  0.597867  0.574339  5  0.743652  2.0
2013-01-04 -1.322116 -0.342312 -1.353458  5 -0.372690  3.0
2013-01-05 -1.072089 -0.589960 -1.326414  5  1.112193  4.0
2013-01-06  0.376197 -1.780693  1.794927  5  0.528141  5.0

In [154]:
df[df > 0] = -df
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -0.335250 -5 -1.478497  NaN
2013-01-02 -0.992497 -0.710643 -0.399813 -5 -2.117459 -1.0
2013-01-03 -0.252339 -0.597867 -0.574339 -5 -0.743652 -2.0
2013-01-04 -1.322116 -0.342312 -1.353458 -5 -0.372690 -3.0
2013-01-05 -1.072089 -0.589960 -1.326414 -5 -1.112193 -4.0
2013-01-06 -0.376197 -1.780693 -1.794927 -5 -0.528141 -5.0

In [155]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns))

In [156]:
df4 = df3[df3>0]

In [157]:
df4.dropna()

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

In [158]:
df4

                   A         B         C         D         E      F
2013-01-01  0.066390  0.423356       NaN  0.126074  1.478497    one
2013-01-02       NaN  0.710643  0.399813       NaN  2.117459    one
2013-01-03  0.252339  0.597867  0.574339       NaN  0.743652    two
2013-01-04       NaN       NaN       NaN       NaN       NaN  three
2013-01-05       NaN       NaN       NaN       NaN  1.112193   four
2013-01-06  0.376197       NaN  1.794927  0.580733  0.528141  three

In [159]:
df4.fillna(value = 0)

                   A         B         C         D         E      F
2013-01-01  0.066390  0.423356  0.000000  0.126074  1.478497    one
2013-01-02  0.000000  0.710643  0.399813  0.000000  2.117459    one
2013-01-03  0.252339  0.597867  0.574339  0.000000  0.743652    two
2013-01-04  0.000000  0.000000  0.000000  0.000000  0.000000  three
2013-01-05  0.000000  0.000000  0.000000  0.000000  1.112193   four
2013-01-06  0.376197  0.000000  1.794927  0.580733  0.528141  three

In [160]:
pd.isnull(df4)

                A      B      C      D      E      F
2013-01-01  False  False   True  False  False  False
2013-01-02   True  False  False   True  False  False
2013-01-03  False  False  False   True  False  False
2013-01-04   True   True   True   True   True  False
2013-01-05   True   True   True   True  False  False
2013-01-06  False   True  False  False  False  False

In [161]:
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -0.335250 -5 -1.478497  NaN
2013-01-02 -0.992497 -0.710643 -0.399813 -5 -2.117459 -1.0
2013-01-03 -0.252339 -0.597867 -0.574339 -5 -0.743652 -2.0
2013-01-04 -1.322116 -0.342312 -1.353458 -5 -0.372690 -3.0
2013-01-05 -1.072089 -0.589960 -1.326414 -5 -1.112193 -4.0
2013-01-06 -0.376197 -1.780693 -1.794927 -5 -0.528141 -5.0

In [162]:
df.mean()

A   -0.669206
B   -0.670246
C   -0.964034
D   -5.000000
E   -1.058772
F   -3.000000
dtype: float64

In [163]:
df.mean(1)

2013-01-01   -1.362749
2013-01-02   -1.703402
2013-01-03   -1.528033
2013-01-04   -1.898429
2013-01-05   -2.183443
2013-01-06   -2.413326
Freq: D, dtype: float64

In [164]:
s = pd.Series([1,3,5,np.nan, 6, 8], index=dates)

In [165]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [166]:
s.shift(2)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [167]:
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -0.335250 -5 -1.478497  NaN
2013-01-02 -0.992497 -0.710643 -0.399813 -5 -2.117459 -1.0
2013-01-03 -0.252339 -0.597867 -0.574339 -5 -0.743652 -2.0
2013-01-04 -1.322116 -0.342312 -1.353458 -5 -0.372690 -3.0
2013-01-05 -1.072089 -0.589960 -1.326414 -5 -1.112193 -4.0
2013-01-06 -0.376197 -1.780693 -1.794927 -5 -0.528141 -5.0

In [168]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [169]:
df.sub(s, axis='index')

                   A         B         C     D         E     F
2013-01-01 -1.000000 -1.000000 -1.335250  -6.0 -2.478497   NaN
2013-01-02 -3.992497 -3.710643 -3.399813  -8.0 -5.117459  -4.0
2013-01-03 -5.252339 -5.597867 -5.574339 -10.0 -5.743652  -7.0
2013-01-04       NaN       NaN       NaN   NaN       NaN   NaN
2013-01-05 -7.072089 -6.589960 -7.326414 -11.0 -7.112193 -10.0
2013-01-06 -8.376197 -9.780693 -9.794927 -13.0 -8.528141 -13.0

In [170]:
df.apply(np.cumsum)

                   A         B         C   D         E     F
2013-01-01  0.000000  0.000000 -0.335250  -5 -1.478497   NaN
2013-01-02 -0.992497 -0.710643 -0.735063 -10 -3.595956  -1.0
2013-01-03 -1.244837 -1.308510 -1.309403 -15 -4.339608  -3.0
2013-01-04 -2.566952 -1.650822 -2.662861 -20 -4.712299  -6.0
2013-01-05 -3.639042 -2.240783 -3.989274 -25 -5.824491 -10.0
2013-01-06 -4.015238 -4.021476 -5.784201 -30 -6.352632 -15.0

In [171]:
df.apply(lambda x: x.max() - x.min())

A    1.322116
B    1.780693
C    1.459677
D    0.000000
E    1.744769
F    4.000000
dtype: float64

In [172]:
s1 = pd.Series(np.random.randint(0,7,size=10))
s1

0    6
1    1
2    5
3    4
4    3
5    4
6    1
7    0
8    0
9    2
dtype: int64

In [173]:
s1.value_counts()

4    2
1    2
0    2
6    1
5    1
3    1
2    1
dtype: int64

In [174]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [175]:
"""Merge Table - Join"""
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [176]:
left

   key  lval
0  foo     1
1  foo     2

In [177]:
right

   key  rval
0  foo     4
1  foo     5

In [178]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [179]:
"""Append"""
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.504234 -0.206201  0.213150  1.077131
1 -0.676464 -0.086049 -0.879997  0.469492
2 -0.632444 -2.025961 -0.565966 -0.444422
3  2.785191  1.679229 -1.288893 -0.090314
4 -0.413502 -0.416302  1.280912  1.569439
5 -0.934591 -0.398843  0.267762 -1.490528
6  1.455030 -1.004302 -0.209456 -1.250501
7  0.932868 -0.859590  0.356315  0.077169
8  2.785191  1.679229 -1.288893 -0.090314

In [180]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [181]:
df

     A      B         C         D
0  foo    one  0.526727  1.376576
1  bar    one -0.202451  0.583710
2  foo    two -1.219156 -0.531834
3  bar  three -1.071327  0.426402
4  foo    two -1.765408 -1.686701
5  bar    two  0.282572  0.087615
6  foo    one  0.289306 -1.479386
7  foo  three -1.647653  0.158942

In [182]:
df.groupby('A').sum()

            C         D
A
bar -0.991206  1.097727
foo -3.816184 -2.162403

In [183]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.202451  0.583710
    three -1.071327  0.426402
    two    0.282572  0.087615
foo one    0.816033 -0.102810
    three -1.647653  0.158942
    two   -2.984564 -2.218535

In [184]:
"""Pivot Tables"""
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.290202 -0.760961
1     one  B  foo -0.696429  0.099740
2     two  C  foo -1.067371  1.497178
3   three  A  bar -0.042401  1.007296
4     one  B  bar  0.218227 -0.164047
5     one  C  bar -1.067515  1.673331
6     two  A  foo  0.631665  0.376901
7   three  B  foo -0.327304  1.068056
8     one  C  foo  0.220489 -0.671909
9     one  A  bar  1.163030 -1.021932
10    two  B  bar  0.793804  0.138348
11  three  C  bar -0.962206 -0.173120

In [185]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.163030 -0.290202
      B  0.218227 -0.696429
      C -1.067515  0.220489
three A -0.042401       NaN
      B       NaN -0.327304
      C -0.962206       NaN
two   A       NaN  0.631665
      B  0.793804       NaN
      C       NaN -1.067371

In [ ]:
numpy.corrcoef(titanic_data['Survived'], titanic_data['Fare'])
titanic_data.plot(kind = 'scatter', x='Age', y = 'Fare').set_yscale('log')
titanic_data.groupby('Pclass').mean()['Fare']
titanic_data.boxplot(column=['Fare'],by = ['Survived'])

In [ ]:
"""Create a Histogram"""
ax = df_age['Age'].hist(bins=8)
ax.set_ylabel('Number of Passengers')
ax.set_xlabel('Age')
ax.set_title('Age Distribution for Survived Passengers')

In [ ]:
titanic_data.groupby(['Survived','Pclass'])[['PassengerId']].count()

In [ ]:
"""WRITE and READ a CSV"""
df.to_csv('foo.csv')
pd.read_csv('foo.csv')